/* Что нужно сделать
Вы продолжаете писать калькулятор, работающий над вещественными числами повышенной точности.
Вы уже научились проверять корректность записи вещественных чисел в виде строк,
и теперь перед вами новая цель — научиться сравнивать такие вещественные числа.

Пользователь вводит две строки, задающие вещественные числа, в том же формате,
как было описано в задаче «Длинное вещественное число». Программа должна проверить
корректность ввода (для этого можно переиспользовать код,
написанный в задаче «Длинное вещественное число»), после чего вывести слово Less,
если первое число строго меньше второго; слово More, если первое число строго больше второго;
и слово Equal, если введённые числа равны.

Примеры:

Ввод: 2.39 3.61
Ответ: Less

Ввод: 0123 12.3
Ответ: More

Ввод: 12345678 12345678.00
Ответ: Equal

Ввод: -1.0 1.0
Ответ: Less

Советы и рекомендации
Активно используйте оператор индексации строки str[i], но помните что индексы начинаются с нуля, а не с единицы.
Создайте отдельную функцию для получения целой и дробной частей числа. Её можно сделать на основе задачи об IP-адресах,
т.к. там тоже использовалась точка в качестве разделителя.
Для сравнения дробных частей можно создать специальную функцию безопасного доступа к символу строки по индексу.
Для дробных чисел, если этот индекс больше длины дробной части, данная функция может безопасно вернуть 0.


Что оценивается
Программа должна выдавать корректные результаты сравнениях двух длинных вещественных чисел.
*/

#include <iostream>
#include <string>
using namespace std;

int CompReal() {
    
    int dot_count = 0;
    bool digit_found = false;
    for (int i = 0; i < input.size(); ++i) {
        char ch = input[i];

        if (ch >= '0' && ch <= '9') {
            digit_found = true;
            continue;
        }
        else if (ch == '.') {
            if (++dot_count > 1) {
                cout << "Incorrect number of dot\n";
                return 1;
            }
            else {
                continue;
            }
        }
        else if (ch == '-' && i == 0) {
            continue;
        }

        cout << "Incorrect symbol " << ch << '\n';
        return 1;

    }
    if (!digit_found) {
        cout << "There is no digit in number\n";
        return 1;
    }

    cout << "Number is correct";
    return 0;
}

int main()
{
    string input;
    cin >> input;
    cout << "Hello World!\n";
}


